reversing/challenge5.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Challenge 5</title>
<meta name="author" content="8dcc" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Challenge 5</h1>
<p>
<a href="../index.html">Index</a> | <a href="index.html">Up</a>
</p>

<hr />

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgee58135">1. Original assembly</a></li>
<li><a href="#org684126d">2. Assembly notes</a></li>
<li><a href="#orgc69475c">3. C translation</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgee58135" class="outline-2">
<h2 id="orgee58135"><span class="section-number-2">1.</span> Original assembly</h2>
<div class="outline-text-2" id="text-1">
<p>
Original challenge link: <a href="https://challenges.re/5/">Click me</a>.
</p>

<p>
This is the original function, adapted to fit the <a href="https://www.nasm.us/">nasm</a> syntax.
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #4ae2ff;">func</span>:
    <span style="color: #feacd0;">cmp</span>     <span style="color: #6ae4b9;">rcx</span>, <span style="color: #6ae4b9;">rsi</span>
    <span style="color: #feacd0;">ja</span>      .L10
    <span style="color: #feacd0;">sub</span>     <span style="color: #6ae4b9;">rsi</span>, <span style="color: #6ae4b9;">rcx</span>
    <span style="color: #feacd0;">add</span>     <span style="color: #6ae4b9;">rsi</span>, <span style="color: #88ca9f;">1</span>
    <span style="color: #feacd0;">mov</span>     <span style="color: #6ae4b9;">r11</span>, <span style="color: #6ae4b9;">rsi</span>
    <span style="color: #feacd0;">je</span>      .L10
    <span style="color: #feacd0;">test</span>    <span style="color: #6ae4b9;">rcx</span>, <span style="color: #6ae4b9;">rcx</span>
    <span style="color: #feacd0;">jne</span>     .L16
    <span style="color: #feacd0;">mov</span>     <span style="color: #6ae4b9;">rax</span>, <span style="color: #6ae4b9;">rdi</span>
    <span style="color: #feacd0;">ret</span>
<span style="color: #4ae2ff;">.L10</span>:
    <span style="color: #feacd0;">xor</span>     <span style="color: #6ae4b9;">eax</span>, <span style="color: #6ae4b9;">eax</span>
    <span style="color: #feacd0;">ret</span>
<span style="color: #4ae2ff;">.L16</span>:
    <span style="color: #feacd0;">push</span>    <span style="color: #6ae4b9;">rbx</span>
    <span style="color: #feacd0;">xor</span>     <span style="color: #6ae4b9;">r10d</span>, <span style="color: #6ae4b9;">r10d</span>
    <span style="color: #feacd0;">mov</span>     <span style="color: #6ae4b9;">r9d</span>, <span style="color: #88ca9f;">1</span>
<span style="color: #4ae2ff;">.L4</span>:
    <span style="color: #feacd0;">lea</span>     <span style="color: #6ae4b9;">rax</span>, [<span style="color: #6ae4b9;">rdi</span> + <span style="color: #6ae4b9;">r10</span>]
    <span style="color: #feacd0;">xor</span>     <span style="color: #6ae4b9;">esi</span>, <span style="color: #6ae4b9;">esi</span>
    <span style="color: #feacd0;">xor</span>     <span style="color: #6ae4b9;">r8d</span>, <span style="color: #6ae4b9;">r8d</span>
<span style="color: #4ae2ff;">.L8</span>:
    <span style="color: #feacd0;">movzx</span>   <span style="color: #6ae4b9;">ebx</span>, <span style="color: #79a8ff;">BYTE</span> [<span style="color: #6ae4b9;">rdx</span> + <span style="color: #6ae4b9;">rsi</span>]
    <span style="color: #feacd0;">cmp</span>     <span style="color: #79a8ff;">BYTE</span> [<span style="color: #6ae4b9;">rax</span> + <span style="color: #6ae4b9;">rsi</span>], <span style="color: #6ae4b9;">bl</span>
    <span style="color: #feacd0;">cmovne</span>  <span style="color: #6ae4b9;">r8d</span>, <span style="color: #6ae4b9;">r9d</span>
    <span style="color: #feacd0;">add</span>     <span style="color: #6ae4b9;">rsi</span>, <span style="color: #88ca9f;">1</span>
    <span style="color: #feacd0;">cmp</span>     <span style="color: #6ae4b9;">rsi</span>, <span style="color: #6ae4b9;">rcx</span>
    <span style="color: #feacd0;">jne</span>     .L8
    <span style="color: #feacd0;">test</span>    <span style="color: #6ae4b9;">r8d</span>, <span style="color: #6ae4b9;">r8d</span>
    <span style="color: #feacd0;">je</span>      .L12
    <span style="color: #feacd0;">add</span>     <span style="color: #6ae4b9;">r10</span>, <span style="color: #88ca9f;">1</span>
    <span style="color: #feacd0;">cmp</span>     <span style="color: #6ae4b9;">r10</span>, <span style="color: #6ae4b9;">r11</span>
    <span style="color: #feacd0;">jne</span>     .L4
    <span style="color: #feacd0;">xor</span>     <span style="color: #6ae4b9;">eax</span>, <span style="color: #6ae4b9;">eax</span>
<span style="color: #4ae2ff;">.L12</span>:
    <span style="color: #feacd0;">pop</span>     <span style="color: #6ae4b9;">rbx</span>
    <span style="color: #feacd0;">ret</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org684126d" class="outline-2">
<h2 id="org684126d"><span class="section-number-2">2.</span> Assembly notes</h2>
<div class="outline-text-2" id="text-2">
<p>
Some important notes before converting the code to a higher level language.
</p>

<p>
As you can see, the first thing the function does is check if <code>rcx</code> is greater
than <code>rsi</code>. If it is, it returns zero. Otherwise, it subtracts <code>rcx</code> from <code>rsi</code>, adds
one to <code>rsi</code>, and uses another <code>je</code> instruction to branch. There are some key
concepts you need to know to understand this:
</p>

<ul class="org-ul">
<li>The <code>je</code> and <code>jz</code> instructions are the same. The <a href="https://www.felixcloutier.com/x86/jcc">opcode</a> for both <code>je rel32</code> and <code>jz
  rel32</code> is <code>0F 84 cd</code>.</li>
<li>Both of these instructions just check the <code>ZF</code> bit inside the EFLAGS
register. See <i>Intel SDM, Vol. 1, Chapter 3.4.3</i> and <i>Vol. 1, Chapter 5.1.7</i>.</li>
<li>This is not only changed by the <code>cmp</code> instruction, but also by other
instructions like <code>add</code>, <code>sub</code>, etc.</li>
</ul>

<p>
So in this case, it's checking if <code>rsi</code> minus <code>rcx</code> plus one is zero or not. In
other words, if <code>rcx</code> is equal to <code>rsi+1</code>. If it is, it returns zero.
</p>
</div>
</div>

<div id="outline-container-orgc69475c" class="outline-2">
<h2 id="orgc69475c"><span class="section-number-2">3.</span> C translation</h2>
<div class="outline-text-2" id="text-3">
<p>
From the <a href="challenge4.html">previous challenge</a>, I learned that it's a good approach to first
convert the assembly code into a higher level language like C, and try to figure
out what the function does from there.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #79a8ff;">int</span> <span style="color: #4ae2ff;">func</span>(<span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">rdi</span>, <span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">rsi</span>, <span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">rdx</span>, <span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">rcx</span>) {
    <span style="color: #ff6f9f;">if</span> (rcx &gt; rsi)
        <span style="color: #989898;">/* </span><span style="color: #989898;">.L10</span><span style="color: #989898;"> */</span>
        <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">0</span>;

    rsi -= rcx + <span style="color: #88ca9f;">1</span>;

    <span style="color: #ff6f9f;">if</span> (rsi == <span style="color: #88ca9f;">0</span>)
        <span style="color: #989898;">/* </span><span style="color: #989898;">.L10</span><span style="color: #989898;"> */</span>
        <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">0</span>;

    <span style="color: #ff6f9f;">if</span> (rcx == <span style="color: #88ca9f;">0</span>)
        <span style="color: #ff6f9f;">return</span> rdi;

    <span style="color: #989898;">/* </span><span style="color: #989898;">.L16</span><span style="color: #989898;"> */</span>

    <span style="color: #989898;">// </span><span style="color: #cabf00; font-weight: bold;">TODO</span>
}
</pre>
</div>
</div>
</div>
</div>
</body>
</html>